[
    {
        "name": "Vampire (Ixalan)",
        "source": "PSX",
        "page": 14,
        "size": [
            "M"
        ],
        "speed": 30,
        "ability": [
            {
                "cha": 2,
                "wis": 1
            }
        ],
        "darkvision": 60,
        "languageProficiencies": [
            {
                "common": true,
                "other": true
            }
        ],
        "resist": [
            "necrotic"
        ],
        "entries": [
            {
                "name": "Age",
                "type": "entries",
                "entries": [
                    "Vampires don't mature and age in the same way that other races do."
                ]
            },
            {
                "name": "Alignment",
                "type": "entries",
                "entries": [
                    "Vampires might not have an innate tendency toward evil, but many of them end up there. Evil or not, their strict hierarchies incline them toward a lawful alignment."
                ]
            },
            {
                "type": "entries",
                "name": "Size",
                "entries": [
                    "Vampires are the same size and build as humans. Your size is Medium."
                ]
            },
            {
                "type": "entries",
                "name": "Bloodthirst",
                "entries": [
                    "You can drain blood and life energy from a willing creature, or one that is {@condition grappled} by you, {@condition incapacitated}, or {@condition restrained}. Make a melee attack against the target. If you hit, you deal 1 piercing damage and {@dice 1d6} necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and you regain hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces it's hit point maximum to 0."
                ]
            },
            {
                "type": "entries",
                "name": "Feast of Blood",
                "entries": [
                    "When you drain blood with your Bloodthirst ability, you experience a surge of vitality. Your speed increases by 10 feet, and you gain advantage on Strength and Dexterity checks and saving throws for 1 minute."
                ]
            },
            {
                "type": "entries",
                "name": "Vampiric Resistance",
                "entries": [
                    "You have resistance to necrotic damage."
                ]
            },
            {
                "name": "Darkvision",
                "entries": [
                    "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
                ],
                "type": "entries"
            },
            {
                "name": "Languages",
                "entries": [
                    "You can speak, read, and write Common (if it exists in your campaign) and Vampire."
                ],
                "type": "entries"
            }
        ],
        "slug": "vampire__ixalan__psx_generic",
        "type": "generic"
    }
]